InformationRegisters/НастройкиСтатистикиПерсонала.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>НастройкиСтатистикиПерсонала</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИспользоватьОтчетностьМониторингаРаботниковСоциальнойСферы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФормаОтчетностиМониторингаРаботниковСоциальнойСферы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Skype</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПолФизическогоЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ПолФизическогоЛица</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Мужской</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Женский</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВАрхиве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УточнениеНаименования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнойСотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>А_КодПоДРФО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяЗарплата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяНачисленияНаЗарплату</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяУдержанияСЗарплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеНаправление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаспределятьПоКарточке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОборудование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаборыЗначенийДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерНабора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДоступа</Name>
							<Comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеДоступа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Чтение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изменение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уточнение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ПодразделенияОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>ПодразделенияОрганизаций</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сформировано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расформировано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРасформирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочиванияИерархического</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботыСотрудников</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>А_Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/СтатистикаПерсонала/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Статистика персонала".
// Процедуры и функции, предназначенные для обслуживания форм статистической отчетности.
//  
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

#Область СправочникДолжности

Процедура ДополнитьФормуЭлементаСправочникаДолжности(Форма, ИмяГруппыДляВставки = "ГруппаКатегории") Экспорт
	
	
КонецПроцедуры

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
// Функции для регламентированной отчетности.

// Возвращает среднесписочную численность, в т.ч. женщин и инвалидов
// 
// Параметры:
//		Организация
//		НачалоПериода
//		КонецПериода
//		ДанныеЧисленности - Структура - с полями ЧисленностьРаботников, ЧисленностьЖенщин, ЧисленностьИнвалидов.
//
Процедура СреднесписочнаяЧисленностьРаботающих(Организация, НачалоПериода, КонецПериода, ДанныеЧисленности, ИсключатьПериодыПоПравилам1ПВ = Истина) Экспорт

	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("Организация", Организация);
	ПараметрыОтчета.Вставить("ДатаНачалаПериодаОтчета", НачалоПериода);
	ПараметрыОтчета.Вставить("ДатаКонцаПериодаОтчета", КонецПериода);
	ПараметрыОтчета.Вставить("ДатаНачалаПериодаВыборки", НачалоПериода);
	ПараметрыОтчета.Вставить("ИсключатьПериодыПоПравилам1ПВ", ИсключатьПериодыПоПравилам1ПВ); 
	
	// Получение данных отчета
	ДанныеОтчета = Новый ДеревоЗначений;
	ДанныеДляЗаполненияРегламентированнойОтчетностиКадры("СреднесписочнаяЧисленность",
		ПараметрыОтчета, ДанныеОтчета);
	
	СтрокаОрганизации = ДанныеОтчета.Строки.Найти(Организация, "Организация");
	
	Если СтрокаОрганизации = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЧислоМесяцев = 12*(Год(НачалоПериода) - Год(КонецПериода)) + Месяц(КонецПериода) - Месяц(НачалоПериода) + 1;
	
	Если ЧислоМесяцев = 0 Тогда
		Возврат;
	КонецЕсли;	
	
	ДанныеЧисленности.ЧисленностьЖенщин = ?(Не ЗначениеЗаполнено(СтрокаОрганизации.СреднесписочнаяЧисленностьЖенщин), 0, Окр(Окр(СтрокаОрганизации.СреднесписочнаяЧисленностьЖенщин/ЧислоМесяцев, 5)));
	ДанныеЧисленности.ЧисленностьИнвалидов = ?(Не ЗначениеЗаполнено(СтрокаОрганизации.СреднесписочнаяЧисленностьИнвалидов), 0,Окр(Окр(СтрокаОрганизации.СреднесписочнаяЧисленностьИнвалидов/ЧислоМесяцев, 5)));
	ДанныеЧисленности.ЧисленностьРаботников = ?(Не ЗначениеЗаполнено(СтрокаОрганизации.СреднесписочнаяЧисленность), 0, Окр(Окр(СтрокаОрганизации.СреднесписочнаяЧисленность/ЧислоМесяцев, 5)));	
	ДанныеЧисленности.ЧисленностьВнешнихСовместителей = ?(Не ЗначениеЗаполнено(СтрокаОрганизации.СреднесписочнаяЧисленностьВнешнихСовместителей), 0, Окр(Окр(СтрокаОрганизации.СреднесписочнаяЧисленностьВнешнихСовместителей/ЧислоМесяцев, 5)));	
	ДанныеЧисленности.ЧисленностьЧисленностьРаботниковГПХ = ?(Не ЗначениеЗаполнено(СтрокаОрганизации.СреднесписочнаяЧисленностьРаботниковГПХ), 0, Окр(Окр(СтрокаОрганизации.СреднесписочнаяЧисленностьРаботниковГПХ/ЧислоМесяцев, 5)));
	ДанныеЧисленности.ЧисленностьЛицСГарантиями = ?(Не ЗначениеЗаполнено(СтрокаОрганизации.СреднесписочнаяЧисленностьЛицСГарантиями), 0, Окр(Окр(СтрокаОрганизации.СреднесписочнаяЧисленностьЛицСГарантиями/ЧислоМесяцев, 5)));	
	ДанныеЧисленности.ЧисленностьЛицСГарантиямиМеньше10ЛетДоПенсии = ?(Не ЗначениеЗаполнено(СтрокаОрганизации.СреднесписочнаяЧисленностьЛицСГарантиямиМеньше10ЛетДоПенсии), 0, Окр(Окр(СтрокаОрганизации.СреднесписочнаяЧисленностьЛицСГарантиямиМеньше10ЛетДоПенсии/ЧислоМесяцев, 5)));	
	ДанныеЧисленности.ЧисленностьЛицСГарантиямиНеИнвалиды = ?(Не ЗначениеЗаполнено(СтрокаОрганизации.СреднесписочнаяЧисленностьЛицСГарантиямиНеИнвалиды), 0, Окр(Окр(СтрокаОрганизации.СреднесписочнаяЧисленностьЛицСГарантиямиНеИнвалиды/ЧислоМесяцев, 5)));	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьГигКонтракты") Тогда
		ДанныеЧисленности.ЧисленностьРаботниковПоГигКонтракту = ?(Не ЗначениеЗаполнено(СтрокаОрганизации.СреднесписочнаяЧисленностьРаботниковПоГигКонтракту), 0, Окр(Окр(СтрокаОрганизации.СреднесписочнаяЧисленностьРаботниковПоГигКонтракту/ЧислоМесяцев, 5)));
	КонецЕсли;

	
КонецПроцедуры

Процедура СреднесписочнаяЧисленностьРаботающих10ПИ(Организация, НачалоПериода, КонецПериода, ДанныеЧисленности) Экспорт

	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("Организация", Организация);
	ПараметрыОтчета.Вставить("ДатаНачалаПериодаОтчета", НачалоПериода);
	ПараметрыОтчета.Вставить("ДатаКонцаПериодаОтчета", КонецПериода);
	ПараметрыОтчета.Вставить("ДатаНачалаПериодаВыборки", НачалоПериода);
	
	// Получение данных отчета
	ДанныеОтчета = Новый ДеревоЗначений;
	СхемаКомпоновки = Отчеты.СтатистикаПерсонала.ПолучитьМакет("СхемаКомпоновкиДанныхКадры");
	
	ПараметрыОтчета.Вставить("Вариант", "СреднесписочнаяЧисленность");
	
	ЗарплатаКадрыОбщиеНаборыДанных.ЗаполнитьОбщиеИсточникиДанныхОтчета(Новый Структура("СхемаКомпоновкиДанных", СхемаКомпоновки));

	ДанныеДляЗаполненияРегламентированнойОтчетностиКадры10ПИ("СреднесписочнаяЧисленность", СхемаКомпоновки,
		ПараметрыОтчета, ДанныеОтчета);
	
	СтрокаОрганизации = ДанныеОтчета.Строки.Найти(Организация, "Организация");
	
	Если СтрокаОрганизации = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЧислоМесяцев = 12*(Год(НачалоПериода) - Год(КонецПериода)) + Месяц(КонецПериода) - Месяц(НачалоПериода) + 1;
	
	Если ЧислоМесяцев = 0 Тогда
		Возврат;
	КонецЕсли;	
	

	ДанныеЧисленности.ЧисленностьИнвалидов = ?(Не ЗначениеЗаполнено(СтрокаОрганизации.СреднесписочнаяЧисленностьИнвалидов), 0,Окр(Окр(СтрокаОрганизации.СреднесписочнаяЧисленностьИнвалидов/ЧислоМесяцев, 5)));
	ДанныеЧисленности.ЧисленностьРаботников = ?(Не ЗначениеЗаполнено(СтрокаОрганизации.СреднесписочнаяЧисленность), 0, Окр(Окр(СтрокаОрганизации.СреднесписочнаяЧисленность/ЧислоМесяцев, 5)));	
	ДанныеЧисленности.ЧисленностьЖенщин = ?(Не ЗначениеЗаполнено(СтрокаОрганизации.СреднесписочнаяЧисленностьЖенщин), 0, Окр(Окр(СтрокаОрганизации.СреднесписочнаяЧисленностьЖенщин/ЧислоМесяцев, 5)));
	ДанныеЧисленности.ЧисленностьМужчин = ДанныеЧисленности.ЧисленностьРаботников - ДанныеЧисленности.ЧисленностьЖенщин;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Сотрудники.Ссылка КАК Сотрудник,
	|	КонтактнаяИнформацияФизлица.ЗначенияПолей КАК ЗначенияПолей
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ФизическиеЛицаКонтактнаяИнформация.ЗначенияПолей КАК ЗначенияПолей,
	|			ФизическиеЛицаКонтактнаяИнформация.Ссылка КАК ФизическоеЛицо
	|		ИЗ
	|			Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
	|				ПО (ФизическиеЛицаКонтактнаяИнформация.Вид = ВидыКонтактнойИнформации.Ссылка)
	|					И (ФизическиеЛицаКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресМестаПроживанияФизическиеЛица))
	|					И (ВидыКонтактнойИнформации.Родитель = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.СправочникФизическиеЛица))) КАК КонтактнаяИнформацияФизлица
	|		ПО Сотрудники.Ссылка.ФизическоеЛицо = КонтактнаяИнформацияФизлица.ФизическоеЛицо
	|ГДЕ
	|	Сотрудники.ГоловнаяОрганизация = &Организация
	|	И Сотрудники.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Выборка = Запрос.Выполнить().Выбрать();
	ТипКонтактнойИнформации = Перечисления.ТипыКонтактнойИнформации.Адрес;
	мСельскиеЖители = Новый Массив;
	//++ ЕРП ЗИК
	Пока Выборка.Следующий() Цикл
		РезультатыЧтения = Новый Структура;
		XDTOКонтактная = УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияИзXML(Выборка.ЗначенияПолей, ТипКонтактнойИнформации, РезультатыЧтения);
		Если НЕ РезультатыЧтения.Свойство("ТекстОшибки") Тогда
			ПредставлениеИнформации = XDTOКонтактная.Состав;
			Если НЕ СокрЛП(ПредставлениеИнформации.Состав.НаселПункт) = "" Тогда
				мСельскиеЖители.Добавить(Выборка.Сотрудник);
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;
	//~Пока Выборка.Следующий() Цикл
	//~	Адрес = Выборка.ЗначенияПолей;
	//~	СтруктураАдреса = РаботаСАдресами.СведенияОбАдресе(Адрес);
	//~	Если НЕ СокрЛП(СтруктураАдреса.НаселенныйПункт) = "" Тогда
	//~		мСельскиеЖители.Добавить(Выборка.Сотрудник);
	//~	КонецЕсли;
	//~КонецЦикла;	

	//-- ЕРП ЗИК
	ПараметрыОтчета.Вставить("мСельскиеЖители", мСельскиеЖители);
	
	ДанныеОтчета = Новый ДеревоЗначений;
	ДанныеДляЗаполненияРегламентированнойОтчетностиКадры10ПИ("СреднесписочнаяЧисленность", СхемаКомпоновки,
		ПараметрыОтчета, ДанныеОтчета);
	
	СтрокаОрганизации = ДанныеОтчета.Строки.Найти(Организация, "Организация");
	
	ЧисленностьПроживающихВСелах = 0;
	ЧисленностьПроживающихВГородах = 0;
	Если НЕ СтрокаОрганизации = Неопределено Тогда
		ЧисленностьПроживающихВСелах = ?(Не ЗначениеЗаполнено(СтрокаОрганизации.СреднесписочнаяЧисленность), 0, Окр(Окр(СтрокаОрганизации.СреднесписочнаяЧисленность/ЧислоМесяцев, 5)));	
		ДанныеЧисленности.ЧисленностьЖенщинПроживающихВСелах = ?(Не ЗначениеЗаполнено(СтрокаОрганизации.СреднесписочнаяЧисленностьЖенщин), 0, Окр(Окр(СтрокаОрганизации.СреднесписочнаяЧисленностьЖенщин/ЧислоМесяцев, 5)));	
	КонецЕсли;	
	ЧисленностьПроживающихВГородах = ДанныеЧисленности.ЧисленностьРаботников - ЧисленностьПроживающихВСелах;
	ДанныеЧисленности.ЧисленностьМужчинПроживающихВСелах = ЧисленностьПроживающихВСелах - ДанныеЧисленности.ЧисленностьЖенщинПроживающихВСелах;
	ДанныеЧисленности.ЧисленностьЖенщинПроживающихВГородах = ДанныеЧисленности.ЧисленностьЖенщин - ДанныеЧисленности.ЧисленностьЖенщинПроживающихВСелах;
	ДанныеЧисленности.ЧисленностьМужчинПроживающихВГородах = ДанныеЧисленности.ЧисленностьМужчин - ДанныеЧисленности.ЧисленностьМужчинПроживающихВСелах;
	
	ПараметрыОтчета.Удалить("мСельскиеЖители");
	
	ПараметрыОтчета.Вставить("НачалоИнтервала", КонецМесяца(ДобавитьМесяц(КонецПериода, -18*12)));
	ПараметрыОтчета.Вставить("ОкончаниеИнтервала", НачалоГода(ДобавитьМесяц(КонецПериода, -35*12)));
	
	ДанныеОтчета = Новый ДеревоЗначений;
	ДанныеДляЗаполненияРегламентированнойОтчетностиКадры10ПИ("СреднесписочнаяЧисленность", СхемаКомпоновки,
		ПараметрыОтчета, ДанныеОтчета);
		
	СтрокаОрганизации = ДанныеОтчета.Строки.Найти(Организация, "Организация");
	
	ЧисленностьРаботниковОт18До35 = 0;
	
	Если НЕ СтрокаОрганизации = Неопределено Тогда
		ЧисленностьРаботниковОт18До35 = ?(Не ЗначениеЗаполнено(СтрокаОрганизации.СреднесписочнаяЧисленность), 0, Окр(Окр(СтрокаОрганизации.СреднесписочнаяЧисленность/ЧислоМесяцев, 5)));
		ДанныеЧисленности.ЧисленностьЖенщинОт18До35 = ?(Не ЗначениеЗаполнено(СтрокаОрганизации.СреднесписочнаяЧисленностьЖенщин), 0, Окр(Окр(СтрокаОрганизации.СреднесписочнаяЧисленностьЖенщин/ЧислоМесяцев, 5)));
	КонецЕсли;
	ДанныеЧисленности.ЧисленностьМужчинОт18До35 = ЧисленностьРаботниковОт18До35 - ДанныеЧисленности.ЧисленностьЖенщинОт18До35;

	ПараметрыОтчета.Вставить("НачалоИнтервала", КонецМесяца(ДобавитьМесяц(КонецПериода, -36*12)));
	ПараметрыОтчета.Вставить("ОкончаниеИнтервала", НачалоГода(ДобавитьМесяц(КонецПериода, -60*12)));
	
	ДанныеОтчета = Новый ДеревоЗначений;
	ДанныеДляЗаполненияРегламентированнойОтчетностиКадры10ПИ("СреднесписочнаяЧисленность", СхемаКомпоновки,
		ПараметрыОтчета, ДанныеОтчета);
		
	СтрокаОрганизации = ДанныеОтчета.Строки.Найти(Организация, "Организация");
	
	ЧисленностьРаботниковОт36До60 = 0;
	
	Если НЕ СтрокаОрганизации = Неопределено Тогда
		ЧисленностьРаботниковОт36До60 = ?(Не ЗначениеЗаполнено(СтрокаОрганизации.СреднесписочнаяЧисленность), 0, Окр(Окр(СтрокаОрганизации.СреднесписочнаяЧисленность/ЧислоМесяцев, 5)));
		ДанныеЧисленности.ЧисленностьЖенщинОт36До60 = ?(Не ЗначениеЗаполнено(СтрокаОрганизации.СреднесписочнаяЧисленностьЖенщин), 0, Окр(Окр(СтрокаОрганизации.СреднесписочнаяЧисленностьЖенщин/ЧислоМесяцев, 5)));
	КонецЕсли;	
	ДанныеЧисленности.ЧисленностьМужчинОт36До60 = ЧисленностьРаботниковОт36До60 - ДанныеЧисленности.ЧисленностьЖенщинОт36До60;

	ПараметрыОтчета.Вставить("НачалоИнтервала", КонецМесяца(ДобавитьМесяц(КонецПериода, -61*12)));
	ПараметрыОтчета.Удалить("ОкончаниеИнтервала");
	
	ДанныеОтчета = Новый ДеревоЗначений;
	ДанныеДляЗаполненияРегламентированнойОтчетностиКадры10ПИ("СреднесписочнаяЧисленность", СхемаКомпоновки,
		ПараметрыОтчета, ДанныеОтчета);
		
	СтрокаОрганизации = ДанныеОтчета.Строки.Найти(Организация, "Организация");
	
	ЧисленностьРаботниковОт60 = 0;
	
	Если НЕ СтрокаОрганизации = Неопределено Тогда
		ЧисленностьРаботниковОт60 = ?(Не ЗначениеЗаполнено(СтрокаОрганизации.СреднесписочнаяЧисленность), 0, Окр(Окр(СтрокаОрганизации.СреднесписочнаяЧисленность/ЧислоМесяцев, 5)));
		ДанныеЧисленности.ЧисленностьЖенщинОт60 = ?(Не ЗначениеЗаполнено(СтрокаОрганизации.СреднесписочнаяЧисленностьЖенщин), 0, Окр(Окр(СтрокаОрганизации.СреднесписочнаяЧисленностьЖенщин/ЧислоМесяцев, 5)));

	КонецЕсли;	
	ДанныеЧисленности.ЧисленностьМужчинОт60 = ЧисленностьРаботниковОт60 - ДанныеЧисленности.ЧисленностьЖенщинОт60;

	ПараметрыОтчета.Вставить("Пол", Перечисления.ПолФизическогоЛица.Женский);
	ПараметрыОтчета.Удалить("НачалоИнтервала");

	// Получение данных отчета
	ДанныеОтчета = Новый ДеревоЗначений;
	ДанныеДляЗаполненияРегламентированнойОтчетностиКадры10ПИ("СреднесписочнаяЧисленность", СхемаКомпоновки,
		ПараметрыОтчета, ДанныеОтчета);
	
	СтрокаОрганизации = ДанныеОтчета.Строки.Найти(Организация, "Организация");
	
	Если НЕ СтрокаОрганизации = Неопределено Тогда
		ДанныеЧисленности.ЧисленностьЖенщинИнвалидов = ?(Не ЗначениеЗаполнено(СтрокаОрганизации.СреднесписочнаяЧисленностьИнвалидов), 0, Окр(Окр(СтрокаОрганизации.СреднесписочнаяЧисленностьИнвалидов/ЧислоМесяцев, 5)));
	КонецЕсли;	
	ДанныеЧисленности.ЧисленностьМужчинИнвалидов = ДанныеЧисленности.ЧисленностьИнвалидов - ДанныеЧисленности.ЧисленностьЖенщинИнвалидов;
	
	ПараметрыОтчета.Вставить("мСельскиеЖители", мСельскиеЖители);
	ПараметрыОтчета.Удалить("Пол");
	
	ДанныеОтчета = Новый ДеревоЗначений;
	ДанныеДляЗаполненияРегламентированнойОтчетностиКадры10ПИ("СреднесписочнаяЧисленность", СхемаКомпоновки,
		ПараметрыОтчета, ДанныеОтчета);
	
	СтрокаОрганизации = ДанныеОтчета.Строки.Найти(Организация, "Организация");
	
	ЧисленностьИнвалидовПроживающихВСелах = 0;
	ЧисленностьИнвалидовПроживающихВГородах = 0;
	Если НЕ СтрокаОрганизации = Неопределено Тогда
		ЧисленностьИнвалидовПроживающихВСелах = ?(Не ЗначениеЗаполнено(СтрокаОрганизации.СреднесписочнаяЧисленностьИнвалидов), 0, Окр(Окр(СтрокаОрганизации.СреднесписочнаяЧисленностьИнвалидов/ЧислоМесяцев, 5)));	
	КонецЕсли;	
	ЧисленностьИнвалидовПроживающихВГородах = ДанныеЧисленности.ЧисленностьИнвалидов - ЧисленностьИнвалидовПроживающихВСелах;
	ПараметрыОтчета.Вставить("Пол", Перечисления.ПолФизическогоЛица.Женский);
	
	ДанныеОтчета = Новый ДеревоЗначений;
	ДанныеДляЗаполненияРегламентированнойОтчетностиКадры10ПИ("СреднесписочнаяЧисленность", СхемаКомпоновки,
		ПараметрыОтчета, ДанныеОтчета);
	
	СтрокаОрганизации = ДанныеОтчета.Строки.Найти(Организация, "Организация");
	
	Если НЕ СтрокаОрганизации = Неопределено Тогда
		ДанныеЧисленности.ЧисленностьЖенщинИнвалидовПроживающихВСелах = ?(Не ЗначениеЗаполнено(СтрокаОрганизации.СреднесписочнаяЧисленностьИнвалидов), 0, Окр(Окр(СтрокаОрганизации.СреднесписочнаяЧисленностьИнвалидов/ЧислоМесяцев, 5)));
	КонецЕсли;	
	ДанныеЧисленности.ЧисленностьМужчинИнвалидовПроживающихВСелах = ЧисленностьИнвалидовПроживающихВСелах - ДанныеЧисленности.ЧисленностьЖенщинИнвалидовПроживающихВСелах;
	ДанныеЧисленности.ЧисленностьЖенщинИнвалидовПроживающихВГородах = ДанныеЧисленности.ЧисленностьЖенщинИнвалидов - ДанныеЧисленности.ЧисленностьЖенщинИнвалидовПроживающихВСелах;
	ДанныеЧисленности.ЧисленностьМужчинИнвалидовПроживающихВГородах = ЧисленностьИнвалидовПроживающихВГородах - ДанныеЧисленности.ЧисленностьЖенщинИнвалидовПроживающихВГородах;
	ПараметрыОтчета.Удалить("мСельскиеЖители");
	ПараметрыОтчета.Удалить("Пол");
	
	ПараметрыОтчета.Вставить("НачалоИнтервала", КонецМесяца(ДобавитьМесяц(КонецПериода, -18*12)));
	ПараметрыОтчета.Вставить("ОкончаниеИнтервала", НачалоГода(ДобавитьМесяц(КонецПериода, -35*12)));
	
	ДанныеОтчета = Новый ДеревоЗначений;
	ДанныеДляЗаполненияРегламентированнойОтчетностиКадры10ПИ("СреднесписочнаяЧисленность", СхемаКомпоновки, 
		ПараметрыОтчета, ДанныеОтчета);
		
	СтрокаОрганизации = ДанныеОтчета.Строки.Найти(Организация, "Организация");
	
	ЧисленностьРаботниковИнвалидовОт18До35 = 0;
	
	Если НЕ СтрокаОрганизации = Неопределено Тогда
		ЧисленностьРаботниковИнвалидовОт18До35= ?(Не ЗначениеЗаполнено(СтрокаОрганизации.СреднесписочнаяЧисленностьИнвалидов), 0, Окр(Окр(СтрокаОрганизации.СреднесписочнаяЧисленностьИнвалидов/ЧислоМесяцев, 5)));
	КонецЕсли;	

	ПараметрыОтчета.Вставить("Пол", Перечисления.ПолФизическогоЛица.Женский);

	ДанныеОтчета = Новый ДеревоЗначений;
	ДанныеДляЗаполненияРегламентированнойОтчетностиКадры10ПИ("СреднесписочнаяЧисленность", СхемаКомпоновки,
		ПараметрыОтчета, ДанныеОтчета);
		
	СтрокаОрганизации = ДанныеОтчета.Строки.Найти(Организация, "Организация");
	Если НЕ СтрокаОрганизации = Неопределено Тогда
		ДанныеЧисленности.ЧисленностьЖенщинИнвалидовОт18До35 = ?(Не ЗначениеЗаполнено(СтрокаОрганизации.СреднесписочнаяЧисленностьИнвалидов), 0, Окр(Окр(СтрокаОрганизации.СреднесписочнаяЧисленностьИнвалидов/ЧислоМесяцев, 5)));
	КонецЕсли;	
	ДанныеЧисленности.ЧисленностьМужчинИнвалидовОт18До35 = ЧисленностьРаботниковИнвалидовОт18До35 - ДанныеЧисленности.ЧисленностьЖенщинИнвалидовОт18До35;
	ПараметрыОтчета.Вставить("НачалоИнтервала", КонецМесяца(ДобавитьМесяц(КонецПериода, -36*12)));
	ПараметрыОтчета.Вставить("ОкончаниеИнтервала", НачалоГода(ДобавитьМесяц(КонецПериода, -60*12)));
	ПараметрыОтчета.Удалить("Пол");
	
	ДанныеОтчета = Новый ДеревоЗначений;
	ДанныеДляЗаполненияРегламентированнойОтчетностиКадры10ПИ("СреднесписочнаяЧисленность", СхемаКомпоновки,
		ПараметрыОтчета, ДанныеОтчета);
		
	СтрокаОрганизации = ДанныеОтчета.Строки.Найти(Организация, "Организация");
	
	ЧисленностьИнвалидовОт36До60 = 0;
	
	Если НЕ СтрокаОрганизации = Неопределено Тогда
		ЧисленностьИнвалидовОт36До60 = ?(Не ЗначениеЗаполнено(СтрокаОрганизации.СреднесписочнаяЧисленностьИнвалидов), 0, Окр(Окр(СтрокаОрганизации.СреднесписочнаяЧисленностьИнвалидов/ЧислоМесяцев, 5)));
	КонецЕсли;	

	ПараметрыОтчета.Вставить("Пол", Перечисления.ПолФизическогоЛица.Женский);

	ДанныеОтчета = Новый ДеревоЗначений;
	ДанныеДляЗаполненияРегламентированнойОтчетностиКадры10ПИ("СреднесписочнаяЧисленность", СхемаКомпоновки,
		ПараметрыОтчета, ДанныеОтчета);
		
	СтрокаОрганизации = ДанныеОтчета.Строки.Найти(Организация, "Организация");
	Если НЕ СтрокаОрганизации = Неопределено Тогда
		ДанныеЧисленности.ЧисленностьЖенщинИнвалидовОт36До60 = ?(Не ЗначениеЗаполнено(СтрокаОрганизации.СреднесписочнаяЧисленностьИнвалидов), 0, Окр(Окр(СтрокаОрганизации.СреднесписочнаяЧисленностьИнвалидов/ЧислоМесяцев, 5)));
	КонецЕсли;
	ДанныеЧисленности.ЧисленностьМужчинИнвалидовОт36До60 = ЧисленностьИнвалидовОт36До60 - ДанныеЧисленности.ЧисленностьЖенщинИнвалидовОт36До60;
	ПараметрыОтчета.Вставить("НачалоИнтервала", КонецМесяца(ДобавитьМесяц(КонецПериода, -61*12)));
	ПараметрыОтчета.Удалить("ОкончаниеИнтервала");
	ПараметрыОтчета.Удалить("Пол");
	
	ДанныеОтчета = Новый ДеревоЗначений;
	ДанныеДляЗаполненияРегламентированнойОтчетностиКадры10ПИ("СреднесписочнаяЧисленность", СхемаКомпоновки,
		ПараметрыОтчета, ДанныеОтчета);
		
	СтрокаОрганизации = ДанныеОтчета.Строки.Найти(Организация, "Организация");
	
	ЧисленностьИнвалидовОт60 = 0;
	
	Если НЕ СтрокаОрганизации = Неопределено Тогда
		ЧисленностьИнвалидовОт60 = ?(Не ЗначениеЗаполнено(СтрокаОрганизации.СреднесписочнаяЧисленностьИнвалидов), 0, Окр(Окр(СтрокаОрганизации.СреднесписочнаяЧисленностьИнвалидов/ЧислоМесяцев, 5)));
	КонецЕсли;	

	ПараметрыОтчета.Вставить("Пол", Перечисления.ПолФизическогоЛица.Женский);

	ДанныеОтчета = Новый ДеревоЗначений;
	ДанныеДляЗаполненияРегламентированнойОтчетностиКадры10ПИ("СреднесписочнаяЧисленность", СхемаКомпоновки,
		ПараметрыОтчета, ДанныеОтчета);
		
	СтрокаОрганизации = ДанныеОтчета.Строки.Найти(Организация, "Организация");
	Если НЕ СтрокаОрганизации = Неопределено Тогда
		ДанныеЧисленности.ЧисленностьЖенщинИнвалидовОт60 = ?(Не ЗначениеЗаполнено(СтрокаОрганизации.СреднесписочнаяЧисленностьИнвалидов), 0, Окр(Окр(СтрокаОрганизации.СреднесписочнаяЧисленностьИнвалидов/ЧислоМесяцев, 5)));
	КонецЕсли;	
	ДанныеЧисленности.ЧисленностьМужчинИнвалидовОт60 = ЧисленностьИнвалидовОт60 - ДанныеЧисленности.ЧисленностьЖенщинИнвалидовОт60;

КонецПроцедуры

Процедура СписочнаяЧисленностьРаботающих(Организация, ДатаАктуальности, ДанныеЧисленности) Экспорт

	
КонецПроцедуры

Процедура ДанныеДляЗаполненияРегламентированнойОтчетностиКадры(Вариант, ПараметрыОтчета, ДанныеОтчета)
	
	СхемаКомпоновки = Отчеты.СтатистикаПерсонала.ПолучитьМакет("СхемаКомпоновкиДанныхКадры");
	
	ПараметрыОтчета.Вставить("Вариант", Вариант);
	
	ЗарплатаКадрыОбщиеНаборыДанных.ЗаполнитьОбщиеИсточникиДанныхОтчета(Новый Структура("СхемаКомпоновкиДанных", СхемаКомпоновки));
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	НастройкиОтчета = ЗаполнитьКомпоновщикНастроек(Вариант, ПараметрыОтчета, СхемаКомпоновки.ВариантыНастроек[Вариант].Настройки);
	
	// Запрос данных
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновки,
		НастройкиОтчета, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных, , , Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ДанныеОтчета);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
КонецПроцедуры

Процедура ДанныеДляЗаполненияРегламентированнойОтчетностиКадры10ПИ(Вариант, СхемаКомпоновки, ПараметрыОтчета, ДанныеОтчета)
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	НастройкиОтчета = ЗаполнитьКомпоновщикНастроек10ПИ(Вариант, ПараметрыОтчета, СхемаКомпоновки.ВариантыНастроек[Вариант].Настройки);
	
	// Запрос данных
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновки,
		НастройкиОтчета, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных, , , Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ДанныеОтчета);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
КонецПроцедуры

Функция ЗаполнитьКомпоновщикНастроек(Вариант, ПараметрыОтчета, НастройкиВарианта)
	
	Организация = ПараметрыОтчета.Организация;
	ДатаНачалаПериодаОтчета = ПараметрыОтчета.ДатаНачалаПериодаВыборки;
	ДатаКонцаПериодаОтчета = ПараметрыОтчета.ДатаКонцаПериодаОтчета;
	ИсключатьПериодыПоПравилам1ПВ = ПараметрыОтчета.ИсключатьПериодыПоПравилам1ПВ; 
	
	// Настройка отборов
	ИсключитьДанныеОбособленныхПодразделений = Ложь;
	Если Не ПараметрыОтчета.Свойство("ИсключитьДанныеОбособленныхПодразделений", ИсключитьДанныеОбособленныхПодразделений) Тогда
		ИсключитьДанныеОбособленныхПодразделений = Ложь
	КонецЕсли;
	
	Подразделение = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
	Если Не ПараметрыОтчета.Свойство("ОбособленноеПодразделение", Подразделение) Тогда
		Подразделение = Справочники.ПодразделенияОрганизаций.ПустаяСсылка()
	КонецЕсли;
	
	МассивПодразделений = ПодразделенияИсключения(Организация, Подразделение, ИсключитьДанныеОбособленныхПодразделений);
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных; 
	КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиВарианта);
	КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("КлючВарианта", Вариант);
	
	ПараметрПериод = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "Период");
	Если ПараметрПериод = Неопределено Тогда
		ПараметрПериод = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "ПериодОтчета");
	КонецЕсли;
	ПараметрПериод.Значение.ДатаНачала = ДатаНачалаПериодаОтчета;
	ПараметрПериод.Значение.ДатаОкончания = ДатаКонцаПериодаОтчета; 
	
	ПараметрИсключатьПериодыПоПравилам1ПВ = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "ИсключатьПериодыПоПравилам1ПВ");
    ПараметрИсключатьПериодыПоПравилам1ПВ.Значение = ИсключатьПериодыПоПравилам1ПВ;
	
	Если ПараметрыОтчета.Свойство("СНачалаГода") Тогда
		ПараметрСНачалаГода = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "СНачалаГода");
		Если ПараметрСНачалаГода <> Неопределено Тогда
			ПараметрСНачалаГода.Значение = ПараметрыОтчета.СНачалаГода;
		КонецЕсли;
	КонецЕсли;
	
	Настройки = КомпоновщикНастроек.Настройки;
	
	Отбор = Настройки.Отбор;
	Отбор.Элементы.Очистить();
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Отбор, "Организация", ВидСравненияКомпоновкиДанных.Равно, Организация);
	
	Если ЗначениеЗаполнено(Подразделение) Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Отбор, "Подразделение", ВидСравненияКомпоновкиДанных.ВСписке, МассивПодразделений);
	КонецЕсли;
	Если ИсключитьДанныеОбособленныхПодразделений Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Отбор, "Подразделение", ВидСравненияКомпоновкиДанных.НеВСписке, МассивПодразделений);
	КонецЕсли;
	
	// Далее следует настройка варианта расшифровки.
	Если Вариант <> "Расшифровка" Тогда
		Возврат КомпоновщикНастроек.ПолучитьНастройки();
	КонецЕсли;
	
	НомерСтроки = ПараметрыОтчета.НомерСтроки;
	НомерКолонки = ПараметрыОтчета.НомерКолонки;
	
	ВидОтчета = ПараметрыОтчета.ВидОтчета;
	
	// Включение полей отчета, по которым выводится расшифровка.
	ВключитьВычисляемоеПоле(Настройки.Выбор, "Сотрудник");
	
	ВариантРасчетаПоказателей = ?(ПараметрыОтчета.Свойство("ВариантРасчетаПоказателей"), ПараметрыОтчета.ВариантРасчетаПоказателей, 0);
	//ОпределитьВидСКД(ВидОтчета, НомерКолонки, ВариантРасчетаПоказателей, Настройки);
	
	
	Возврат КомпоновщикНастроек.ПолучитьНастройки();
	
КонецФункции

Функция ЗаполнитьКомпоновщикНастроек10ПИ(Вариант, ПараметрыОтчета, НастройкиВарианта)
	
	Организация = ПараметрыОтчета.Организация;
	ДатаНачалаПериодаОтчета = ПараметрыОтчета.ДатаНачалаПериодаВыборки;
	ДатаКонцаПериодаОтчета = ПараметрыОтчета.ДатаКонцаПериодаОтчета;
	
	// Настройка отборов
		
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных; 
	КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиВарианта);
	КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("КлючВарианта", Вариант);
	
	ПараметрПериод = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "Период");

	Если ПараметрПериод = Неопределено Тогда
		ПараметрПериод = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "ПериодОтчета");
	КонецЕсли;
	
	ПараметрПериод.Значение.ДатаНачала = ДатаНачалаПериодаОтчета;
	ПараметрПериод.Значение.ДатаОкончания = ДатаКонцаПериодаОтчета;
	
	Если ПараметрыОтчета.Свойство("СНачалаГода") Тогда
		ПараметрСНачалаГода = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "СНачалаГода");
		Если ПараметрСНачалаГода <> Неопределено Тогда
			ПараметрСНачалаГода.Значение = ПараметрыОтчета.СНачалаГода;
		КонецЕсли;
	КонецЕсли;
	
	Настройки = КомпоновщикНастроек.Настройки;
	
	Отбор = Настройки.Отбор;
	Отбор.Элементы.Очистить();
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Отбор, "Организация", ВидСравненияКомпоновкиДанных.Равно, Организация);
	
	Если ПараметрыОтчета.Свойство("Пол") Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Отбор, "Сотрудник.ФизическоеЛицо.Пол", ВидСравненияКомпоновкиДанных.Равно, Перечисления.ПолФизическогоЛица.Женский);
	КонецЕсли;
	Если ПараметрыОтчета.Свойство("мСельскиеЖители") Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Отбор, "Сотрудник", ВидСравненияКомпоновкиДанных.ВСписке, ПараметрыОтчета.мСельскиеЖители);
	КонецЕсли;
	
	Если ПараметрыОтчета.Свойство("НачалоИнтервала") И ПараметрыОтчета.Свойство("ОкончаниеИнтервала") Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Отбор, "Сотрудник.ФизическоеЛицо.ДатаРождения", ВидСравненияКомпоновкиДанных.МеньшеИлиРавно, ПараметрыОтчета.НачалоИнтервала);
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Отбор, "Сотрудник.ФизическоеЛицо.ДатаРождения", ВидСравненияКомпоновкиДанных.БольшеИлиРавно, ПараметрыОтчета.ОкончаниеИнтервала);
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Отбор, "Сотрудник.ФизическоеЛицо.ДатаРождения", ВидСравненияКомпоновкиДанных.НеРавно, Дата(1,1,1,0,0,0));
	КонецЕсли;
	Если ПараметрыОтчета.Свойство("НачалоИнтервала") И НЕ ПараметрыОтчета.Свойство("ОкончаниеИнтервала") Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Отбор, "Сотрудник.ФизическоеЛицо.ДатаРождения", ВидСравненияКомпоновкиДанных.Меньше, ПараметрыОтчета.НачалоИнтервала);
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Отбор, "Сотрудник.ФизическоеЛицо.ДатаРождения", ВидСравненияКомпоновкиДанных.НеРавно, Дата(1,1,1,0,0,0));
	КонецЕсли;
	// Далее следует настройка варианта расшифровки.
	Если Вариант <> "Расшифровка" Тогда
		Возврат КомпоновщикНастроек.ПолучитьНастройки();
	КонецЕсли;
	
	НомерСтроки = ПараметрыОтчета.НомерСтроки;
	НомерКолонки = ПараметрыОтчета.НомерКолонки;
	
	ВидОтчета = ПараметрыОтчета.ВидОтчета;
	
	// Включение полей отчета, по которым выводится расшифровка.
	ВключитьВычисляемоеПоле(Настройки.Выбор, "Сотрудник");
	
	
	Возврат КомпоновщикНастроек.ПолучитьНастройки();
	
КонецФункции

Процедура ВключитьВычисляемоеПоле(ВыбранныеПоля, ИмяПоля)
	
	Если Лев(ИмяПоля, 20) = "ПользовательскиеПоля" Тогда
		ИмяПоля = СтрЗаменить(ИмяПоля, "ПользовательскиеПоля", "ПользовательскиеПоля.");
	КонецЕсли;
	
	ИскомоеПоле = Новый ПолеКомпоновкиДанных(ИмяПоля);
	
	Для Каждого НастройкаПоля Из ВыбранныеПоля.Элементы Цикл
		Если НастройкаПоля.Поле = ИскомоеПоле Тогда
			НастройкаПоля.Использование = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПодразделенияИсключения(Организация, Подразделение, ИсключитьДанныеОбособленныхПодразделений)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Если ИсключитьДанныеОбособленныхПодразделений  Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодразделенияОрганизаций.Ссылка
		|ПОМЕСТИТЬ ВТПодразделенияВерхнегоУровня
		|ИЗ
		|	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
		|ГДЕ
		|	ПодразделенияОрганизаций.Владелец = &Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПодразделенияОрганизаций.Ссылка
		|ИЗ
		|	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
		|ГДЕ
		|	ПодразделенияОрганизаций.Ссылка В ИЕРАРХИИ
		|			(ВЫБРАТЬ
		|				ПодразделенияВерхнегоУровня.Ссылка
		|			ИЗ
		|				ВТПодразделенияВерхнегоУровня КАК ПодразделенияВерхнегоУровня)
		|	И ПодразделенияОрганизаций.Владелец = &Организация";
		ПустыеКоды = Новый Массив;
		ПустыеКоды.Добавить("");
		ПустыеКоды.Добавить("              ");
		Запрос.УстановитьПараметр("ПустыеКоды", ПустыеКоды);
		
	ИначеЕсли ЗначениеЗаполнено(Подразделение) Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодразделенияОрганизаций.Ссылка
		|ИЗ
		|	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
		|ГДЕ
		|	ПодразделенияОрганизаций.Ссылка В ИЕРАРХИИ(&Подразделение)
		|	И ПодразделенияОрганизаций.Владелец = &Организация";
		Запрос.УстановитьПараметр("Подразделение", Подразделение);
		
	Иначе
		
		Возврат Новый Массив
		
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции 



#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Чтение настроек подсистемы статистики персонала.
// Если формирование отчетных форм статистики отключено, функция возвращает
// структуру с единственным реквизитом ИспользоватьОтчетностьМониторингаРаботниковСоциальнойСферы,
// установленным в значение ЛОЖЬ.
//
// ВозвращаемоеЗначение:
//  Структура настроек
//
Функция НастройкиСтатистикиПерсонала() Экспорт

	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("ИспользоватьОтчетностьМониторингаРаботниковСоциальнойСферы", Ложь);
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьОтчетностьМониторингаРаботниковСоциальнойСферы") Тогда
		Возврат СтруктураНастроек;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	НастройкиСтатистикиПерсонала.ИспользоватьОтчетностьМониторингаРаботниковСоциальнойСферы,
		|	НастройкиСтатистикиПерсонала.ФормаОтчетностиМониторингаРаботниковСоциальнойСферы
		|ИЗ
		|	РегистрСведений.НастройкиСтатистикиПерсонала КАК НастройкиСтатистикиПерсонала";

	РезультатЗапроса = Запрос.Выполнить().Выгрузить();

	Если РезультатЗапроса.Количество() > 0 Тогда
		СтруктураНастроек = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(РезультатЗапроса[0]);
	КонецЕсли;
	
	Возврат СтруктураНастроек;

КонецФункции

Процедура УстановитьПустоеЗначение(Значение, ИмяЯчейки, Контейнер) Экспорт
	Если Контейнер.ПолеТабличногоДокументаФормаОтчета.Свойство(ИмяЯчейки) И (Значение = 0 Или Значение = Null) Тогда
		Контейнер.ПолеТабличногоДокументаФормаОтчета[ИмяЯчейки] = "ЧН=-";
	КонецЕсли;		
КонецПроцедуры

Процедура УстановитьПустоеЗначениеЧисленности(Значение, ИмяЯчейки, Контейнер) Экспорт
	Если Контейнер.ПолеТабличногоДокументаФормаОтчета.Свойство(ИмяЯчейки) И (Значение = Null Или Значение < 0.1) Тогда
		Контейнер.ПолеТабличногоДокументаФормаОтчета[ИмяЯчейки] = "ЧН=-";
	КонецЕсли;
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// Блок функций первоначального заполнения и обновления ИБ.

// Добавляет в список Обработчики процедуры-обработчики обновления,
// необходимые данной подсистеме.
//
// Параметры:
//   Обработчики - ТаблицаЗначений - см. описание функции НоваяТаблицаОбработчиковОбновления
//                                   общего модуля ОбновлениеИнформационнойБазы.
// 
Процедура ЗарегистрироватьОбработчикиОбновления(Обработчики) Экспорт
	

КонецПроцедуры

#КонецОбласти
